In [22]:
import pandas as pd
import numpy as np

In [23]:
df = pd.read_csv("./data/weight-height.csv")

In [24]:
df

      Gender     Height      Weight
0       Male  73.847017  241.893563
1       Male  68.781904  162.310473
2       Male  74.110105  212.740856
3       Male  71.730978  220.042470
4       Male  69.881796  206.349801
...      ...        ...         ...
9995  Female  66.172652  136.777454
9996  Female  67.067155  170.867906
9997  Female  63.867992  128.475319
9998  Female  69.034243  163.852461
9999  Female  61.944246  113.649103

[10000 rows x 3 columns]

In [25]:
df.shape

(10000, 3)

In [26]:
df.describe()

             Height        Weight
count  10000.000000  10000.000000
mean      66.367560    161.440357
std        3.847528     32.108439
min       54.263133     64.700127
25%       63.505620    135.818051
50%       66.318070    161.212928
75%       69.174262    187.169525
max       78.998742    269.989699

In [27]:
df['Height']

0       73.847017
1       68.781904
2       74.110105
3       71.730978
4       69.881796
          ...
9995    66.172652
9996    67.067155
9997    63.867992
9998    69.034243
9999    61.944246
Name: Height, Length: 10000, dtype: float64

In [28]:
Q1 = df['Height'].quantile(0.25)

In [29]:
Q1

63.505620481218955

In [30]:
Q2 = df['Height'].quantile(0.5)

In [31]:
Q2

66.31807008178464

In [32]:
Q3 = df['Height'].quantile(0.75)

In [33]:
Q3

69.1742617268347

In [34]:
np.percentile(df['Height'], q = 25)

63.505620481218955

In [35]:
np.var(df['Height'])

14.801992292876763

In [36]:
df['Height'].mean()

66.36755975482124

In [37]:
df_male = df[df['Gender'] == 'Male']

In [38]:
df_male

     Gender     Height      Weight
0      Male  73.847017  241.893563
1      Male  68.781904  162.310473
2      Male  74.110105  212.740856
3      Male  71.730978  220.042470
4      Male  69.881796  206.349801
...     ...        ...         ...
4995   Male  68.860062  177.131052
4996   Male  68.973423  159.285228
4997   Male  67.013795  199.195400
4998   Male  71.557718  185.905909
4999   Male  70.351880  198.903012

[5000 rows x 3 columns]

In [39]:
np.std(df['Height'])

3.84733573955754

In [40]:
IQR = Q3 - Q1

In [41]:
IQR

5.668641245615746